// Шаг 3. Делаем игру интерактивной: диалог с пользователем
// Задача: спросить у пользователя, что он хочет сделать.
// Концепции: cin >>, условный оператор if / else if.

#include <iostream>
#include <string>
using namespace std;

int main()
{
    string petName = "Бобик";
    int hunger = 50;    // Шкала от 0 (сыт) до 100 (очень голоден)
    int happiness = 50; // Шкала от 0 (грустный) до 100 (очень счастлив)

    cout << "Поздравляем! У вас родился цифровой питомец!" << endl;
    cout << "Его зовут - " << petName << "!" << endl;
    cout << "-------------------------------" << endl;
    cout << "Голод: " << hunger << "/100" << endl;
    cout << "Настроение: " << happiness << "/100" << endl;
    cout << "-------------------------------" << endl;

    int choice; // Переменная для выбора пользователя

    cout << "Что вы хотите сделать?" << endl;
    cout << "1 - Покормить" << endl;
    cout << "2 - Поиграть" << endl;
    cout << "Ваш выбор: ";
    // Ждем, пока пользователь введет число
    cin >> choice;

    // Обрабатываем выбор пользователя
    if (choice == 1) {
        cout << "Вы покормили " << petName << "! Он доволен." << endl;
        hunger -= 30;    // Уменьшаем голод
        happiness += 10; // Немного увеличиваем счастье
    }
    else if (choice == 2) {
        cout << "Вы поиграли с " << petName << "! Он виляет хвостом." << endl;
        hunger += 20;    // Игра - это энергозатратно!
        happiness += 30; // Сильно увеличиваем счастье
    }
    else {
        cout << "Вы сидите и смотрите на " << petName << ". Он смотрит на вас." << endl;
    }

    // Обновляем и выводим состояние питомца
    cout << "-------------------------------" << endl;
    cout << "Теперь голод: " << hunger << "/100" << endl;
    cout << "Теперь настроение: " << happiness << "/100" << endl;

    return 0;
}
